HPPA01_HPE_request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <getProducts xmlns="http://www.hp.com/axis/services/EZPrs">
         <transaction>
            <queryProducts>
               <queryProduct>
                  <paramProduct>
                     <params>
                        <param>
                           <name>Country</name>
                           <value>US</value>
                        </param>
                        <param>
                           <name>Currency</name>
                           <value>USD</value>
                        </param>
                        <param>
                           <name>IncoTerms</name>
                           <value>DDP</value>
                        </param>
                        <param>
                           <name>PurchaseAgreement</name>
                           <value>2B958</value>
                        </param>
                        <param>
                           <name>CustomerApplCode</name>
                           <value>V</value>
                        </param>
                        <param>
                           <name>DiscountGeo</name>
                           <value>FR</value>
                        </param>
                        <param>
                           <name>Language</name>
                           <value>EN</value>
                        </param>
                        <param>
                           <name>Date</name>
                           <value>20161213</value>
                           <type>date</type>
                        </param>
                        <param>
                           <name>PricingProc</name>
                           <value>HPPA01</value>
                        </param>
                     </params>
                  </paramProduct>
                  <baseProductAttr>
                     <attrProduct>
                        <attrs>
			                     <attr>
                              <name>DealTenantCode</name>
                           </attr> 	
			                     <attr>
                              <name>PurchaseAgreementTenantCode</name>
                           </attr> 	
			                     <attr>
                              <name>ProductTenantCode</name>
                           </attr> 	
			                     <attr>
                              <name>EzprsCompanyCode</name>
                           </attr> 
 			                     <attr>
                              <name>NetPrice</name>
                           </attr> 
                           <attr>
                              <name>ListPrice</name>
                           </attr>
                        </attrs>
                     </attrProduct>
                  </baseProductAttr>
                  <variantAttr>
                     <attrProduct>
                        <attrs>
			                     <attr>
                              <name>DealTenantCode</name>
                           </attr> 	
			                     <attr>
                              <name>PurchaseAgreementTenantCode</name>
                           </attr> 	
			                     <attr>
                              <name>ProductTenantCode</name>
                           </attr> 	
			                     <attr>
                              <name>EzprsCompanyCode</name>
                           </attr> 
 			                     <attr>
                              <name>NetPrice</name>
                           </attr> 
                           <attr>
                              <name>ListPrice</name>
                           </attr>
                        </attrs>
                     </attrProduct>
                  </variantAttr>
                  <keys>
                     <keyProducts>
                        <keyProduct>
                           <productId>103825-002</productId>
                           <qty>1</qty>
                        </keyProduct>
                     </keyProducts>
                  </keys>
               </queryProduct>
            </queryProducts>
            <clientName>eclipse</clientName>
            <clientId>ezprs4eclipse</clientId>
         </transaction>
      </getProducts>
   </soap:Body>
</soap:Envelope>
